load-test/test.yml
config:
  target: "http://ec2co-ecsel-ihmakksxzgq0-686416472.us-east-1.elb.amazonaws.com/"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "Index page"
    flow:
      - get:
          url: "/"
      - think: 3